; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-80)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b24)
    (on b24 b12)
    (on b12 b3)
    (on b3 b9)
    (on b9 b7)
    (on b7 b13)
    (on b13 b2)
    (on b2 b23)
    (on b23 b6)
    (on b6 b17)
    (on b17 b11)
    (on b11 b1)
    (on b1 b22)
    (on b22 b15)
    (on b15 b18)
    (on b18 b4)
    (on b4 b21)
    (on b21 b5)
    (on b5 b10)
    (on b10 b16)
    (on b16 b14)
    (on b14 b19)
    (on b19 b20)
    (on b20 b8)
    (on-table b8))
 (:goal (and 
(on-table b12)
))
)

; plan
1. (unstack b24 b12)
   deleted: (on b24 b12) (clear b24) (arm-empty)
   added: (holding b24) (clear b12)
   goals met: 0 of 1
2. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
3. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 0 of 1
4. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 1
